/*************************************************************************
        > File Name: 2.sum.c
        > Author:ZhangNan 
        > Mail:1470161695@qq.com 
        > Created Time: Wed 11 Sep 2024 09:21:12 AM CST
 ************************************************************************/

//函数的使用提高了代码的重用率
//固定了程序的计算逻辑

#include<stdio.h>

int sum(int a, int b, int c){
    int n1 = (b - a) / c + 1;          //末项减去首项除以公差加一等于项数
    int a1n = a + (n1 - 1) * c;        //项数减去一乘以公差加一等于末项值
    return (a + a1n) * n1 / 2;
}
int main(){
    int sum1 = (1 + 100) * 100 / 2;
    //首项为1，末项不超过100，公差为2的等差数列的求和
    int n2 = (100 - 1) / 2 + 1;        //求项数              
    int a2n = 1 + (n2 - 1) * 2;        //求末项值
    int sum2 = (1 + a2n) * n2 /2;       //首项加末项乘项数除以二
    //首项为26，末项不超过36999，公差为47的等差数列的求和
    int n3 = (36999 - 26) / 47 + 1;
    int a3n = 26 + (n3 - 1) * 47;
    int sum3 = (26 + a3n) * n3 / 2;
    printf("%d %d %d\n", sum1, sum2, sum3);

    printf("---------------\n");

    printf("%d ", sum(1, 100, 1));
    printf("%d ", sum(1, 100, 2));
    printf("%d\n", sum(26, 36999, 47));
    return 0;
}