/*************************************************************************
        > File Name: 23.pointer_test.c
        > Author:ZhangNan 
        > Mail:1470161695@qq.com 
        > Created Time: Sat 05 Oct 2024 04:10:17 PM CST
 ************************************************************************/

#include<stdio.h>

int main() {
    int (*p1)[10];
    int a[2][10] = {
        {1, 2, 3, 4, 5, 6, 7, 8, 9, 10},
        {11, 12, 13, 14, 15, 16, 17, 18, 19, 20}
    };
    p1 = a;
    for(int i = 0; i < 2; i++) {
        for(int j = 0; j < 10; j++) {
            printf("%p[%d] = %d\n", p1, j, (*p1)[j]);           //在此处想要输出所谓的二维指针的内容的时候一定要按照标准的格式来写
            printf("%p[%d] = %p\n\n", p1, j, &a[i][j]);
        }
        p1++;
    }
    printf("-------------------------------\n");
    for(int i = 0; i < 2; i++) {
        for(int j = 0; j < 10; j++) {
            printf("a[%d][%d] = %d\n", i, j, a[i][j]);
            printf("a[%d][%d] = %p\n\n", i, j, &a[i][j]);
        }
    }
    return 0;
}