/*************************************************************************
        > File Name: 26.demo.c
        > Author:ZhangNan 
        > Mail:1470161695@qq.com 
        > Created Time: Sun 13 Oct 2024 04:10:16 PM CST
 ************************************************************************/

#include<stdio.h>

//利用指针的等价形式，进行转化，便自己理解
int main() {
    int arr[] = {0, 1, 2, 3, 4, 5, 6};
    int *p = arr;
    for(int i = 0; i < 3; i++) {
        printf("%d\n", (i + 5)[&p[1] - 2]);
    }
    return 0;
}